src/Reports/СебестоимостьПриборов/СебестоимостьПриборов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СебестоимостьПриборов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/НормыВремени/НормыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыВремени</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыТО/НормыТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МашинноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаНастройку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениНаОбдув</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехОперация</name>
    <type>
      <types>CatalogRef.ТехОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Себестоимость/Себестоимость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Себестоимость</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ЗарплатнаяЧасть</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьПолная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поступление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Reports/СебестоимостьПриборов/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
СписокТО = Новый СписокЗначений;
ТаблицаИзделий = Новый ТаблицаЗначений;
ТаблицаТО = Новый ТаблицаЗначений;

ТаблицаИзделий.Колонки.Добавить("Изделие",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаИзделий.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)));

ТаблицаТО.Колонки.Добавить("ТО",Новый ОписаниеТипов("СправочникСсылка.ТехОперации"));
ТаблицаТО.Колонки.Добавить("СуммаТО",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,2)));

	Если Линейка.ЭтоГруппа Тогда
	Выборка = Справочники.Линейки.Выбрать(Линейка);
		Если Выборка.Следующий() Тогда
		ГруппаТехОпераций = Справочники.ТехОперации.НайтиПоРеквизиту("Подразделение",Выборка.Подразделение);
		КонецЕсли;	
	Иначе	
	ГруппаТехОпераций = Справочники.ТехОперации.НайтиПоРеквизиту("Подразделение",Линейка.Подразделение);	
	КонецЕсли; 
ВыборкаТО = Справочники.ТехОперации.ВыбратьИерархически(ГруппаТехОпераций);
	Пока ВыборкаТО.Следующий() Цикл
		Если ВыборкаТО.ЭтоГруппа Тогда
		Продолжить;	
		КонецЕсли;
	СписокТО.Добавить(ВыборкаТО.Ссылка,ВыборкаТО.Ссылка.Код);
	ТЧ = ТаблицаТО.Добавить();
	ТЧ.ТО = ВыборкаТО.Ссылка;
	КонецЦикла;
СписокТО.СортироватьПоПредставлению();
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщая = Макет.ПолучитьОбласть("Шапка|Общая");
ОблШапкаТехОперация = Макет.ПолучитьОбласть("Шапка|ТехОперация");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблИзделиеОбщая = Макет.ПолучитьОбласть("Изделие|Общая");
ОблИзделиеТехОперация = Макет.ПолучитьОбласть("Изделие|ТехОперация");
ОблИзделиеИтого = Макет.ПолучитьОбласть("Изделие|Итого");
ОблКонецОбщая = Макет.ПолучитьОбласть("Конец|Общая");
ОблКонецТехОперация = Макет.ПолучитьОбласть("Конец|ТехОперация");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого");

ОблШапкаОбщая.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщая.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщая);
	Для каждого ТО Из СписокТО Цикл	
	ОблШапкаТехОперация.Параметры.ТО = ТО.Значение;
	ТабДок.Присоединить(ОблШапкаТехОперация);				
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);

ПолнаяСуммаЗП = ОбщийМодульВызовСервера.ПолучитьПолнуюСуммуЗарплаты(Линейка.Подразделение,Линейка,Отчет.Период.ДатаОкончания);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыпускПродукцииПоступление.Номенклатура КАК Изделие,
	|	ВыпускПродукцииПоступление.Количество КАК Количество,
	|	ВыпускПродукцииПоступление.Номенклатура.Наименование КАК НоменклатураНаименование
	|ИЗ
	|	Документ.ВыпускПродукции.Поступление КАК ВыпускПродукцииПоступление
	|ГДЕ
	|	ВыпускПродукцииПоступление.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ВыпускПродукцииПоступление.Ссылка.НаСклад = ИСТИНА
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.ДокументОснование.Ремонт = ЛОЖЬ
	|	И ВыпускПродукцииПоступление.Ссылка.ДокументОснование.Линейка В ИЕРАРХИИ(&ГруппаЛинеек)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Изделие"; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("ГруппаЛинеек", Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаИзделия = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
СуммаИтогоВсего = 0;
	Пока ВыборкаИзделия.Следующий() Цикл
	Время = 0;
	ТЧ = ТаблицаИзделий.Добавить();
	ТЧ.Изделие = ВыборкаИзделия.Изделие;
	ТЧ.Количество = ВыборкаИзделия.Количество;
		Для каждого ТО Из СписокТО Цикл
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ТЧ.Изделие,ТО.Значение));
		НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
		Расценка = НормыВремени.НормаВремени/60*НормыТО.Стоимость;
		СуммаИтогоВсего = СуммаИтогоВсего + Расценка*ТЧ.Количество;
		КонецЦикла;
	КонецЦикла;
КоличествоВсего = 0;
//СуммаИтогоВсего = 0;
НомСтр = 0;
	Для каждого ТЧ Из ТаблицаИзделий Цикл
	НВИтого = 0;
	РасценкаИтого = 0;
	СуммаИтого = 0;
	Время = 0;
	Себестоимость = 0;
	НомСтр = НомСтр + 1;
	ОблИзделиеОбщая.Параметры.НомСтр = НомСтр;
	ОблИзделиеОбщая.Параметры.Статус = ПолучитьСтатус(ТЧ.Изделие);
	ОблИзделиеОбщая.Параметры.Наименование = СокрЛП(ТЧ.Изделие.Наименование);
	ОблИзделиеОбщая.Параметры.Изделие = ТЧ.Изделие;
	ОблИзделиеОбщая.Параметры.Количество = ТЧ.Количество;
	ТабДок.Вывести(ОблИзделиеОбщая);
	КоличествоВсего = КоличествоВсего + ТЧ.Количество;
		Для каждого ТО Из СписокТО Цикл
		НормыВремени = РегистрыСведений.НормыВремени.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("МПЗ,ТехОперация",ТЧ.Изделие,ТО.Значение));
		НормыТО = РегистрыСведений.НормыТО.ПолучитьПоследнее(Отчет.Период.ДатаНачала,Новый Структура("ТехОперация",ТО.Значение));
		Расценка = НормыВремени.НормаВремени/60*НормыТО.Стоимость;
		ОблИзделиеТехОперация.Параметры.НВ = НормыВремени.НормаВремени;
		ОблИзделиеТехОперация.Параметры.Расценка = Расценка;
		Сумма = Расценка*ТЧ.Количество;
		ОблИзделиеТехОперация.Параметры.Сумма = Сумма;
		ТабДок.Присоединить(ОблИзделиеТехОперация);
		НВИтого = НВИтого + НормыВремени.НормаВремени;
		РасценкаИтого = РасценкаИтого + Расценка;
		СуммаИтого = СуммаИтого + Сумма;
		Выборка = ТаблицаТО.НайтиСтроки(Новый Структура("ТО",ТО.Значение));
		Выборка[0].СуммаТО = Выборка[0].СуммаТО + Сумма;
		Время = Время + НормыВремени.НормаВремени;				
		КонецЦикла;
	ОблИзделиеИтого.Параметры.НВИтого = НВИтого;
	ОблИзделиеИтого.Параметры.РасценкаИтого = РасценкаИтого;
	ОблИзделиеИтого.Параметры.СуммаИтого = СуммаИтого;
	СебестоимостьПолная = ПолнаяСуммаЗП/СуммаИтогоВсего*РасценкаИтого;
	ОблИзделиеИтого.Параметры.СебестоимостьПолная = СебестоимостьПолная;
	ТабДок.Присоединить(ОблИзделиеИтого);			
		Если СохранитьДанныеСебестоимости Тогда
		РегистрСведенийСебестоимость = РегистрыСведений.Себестоимость.СоздатьМенеджерЗаписи();
		РегистрСведенийСебестоимость.Период = Отчет.Период.ДатаНачала;
	    РегистрСведенийСебестоимость.Подразделение = Линейка.Подразделение;
	    РегистрСведенийСебестоимость.Линейка = Линейка;
	    РегистрСведенийСебестоимость.Номенклатура = ТЧ.Изделие;
		РегистрСведенийСебестоимость.ЗарплатнаяЧасть = СебестоимостьПолная;
		РегистрСведенийСебестоимость.Записать(Истина);
		КонецЕсли;
//	СуммаИтогоВсего = СуммаИтогоВсего + СуммаИтого;
	КонецЦикла;
ОблКонецОбщая.Параметры.КоличествоВсего = КоличествоВсего;
ТабДок.Вывести(ОблКонецОбщая);
	Для каждого ТО Из СписокТО Цикл
	Выборка = ТаблицаТО.Найти(ТО.Значение,"ТО");
	ОблКонецТехОперация.Параметры.СуммаВсего = Выборка.СуммаТО;
	ТабДок.Присоединить(ОблКонецТехОперация); 	
	КонецЦикла;
ОблКонецИтого.Параметры.СуммаИтогоВсего = СуммаИтогоВсего;
ОблКонецИтого.Параметры.ПолнаяСуммаЗП = ПолнаяСуммаЗП;
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 3;
ТабДок.ФиксацияСлева = 4;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЛинеек()
СписокЛинеек = Новый СписокЗначений;

	Если Линейка.ЭтоГруппа Тогда
	Выборка = Справочники.Линейки.Выбрать(Линейка);
		Если Выборка.Следующий() Тогда
		СписокЛинеек.Добавить(Выборка.Ссылка);
		КонецЕсли;	
	Иначе	
	СписокЛинеек.Добавить(Линейка);	
	КонецЕсли;
Возврат(СписокЛинеек);
КонецФункции 

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если ОбщийМодульВызовСервера.РазрешенныйСписокЛинеек(ПолучитьСписокЛинеек()) Тогда
		СформироватьНаСервере();
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.Период.ДатаНачала = Результат;
	Отчет.Период.ДатаОкончания = КонецМесяца(Результат);
	КонецЕсли; 
КонецПроцедуры
